<a href="https://colab.research.google.com/github/mkmahto2/summerintership_goeduhub/blob/main/IMDB_Basic_Data_Analysis.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

### ***Importing Pandas & Numpy***

In [ ]:
import numpy as np
import pandas as pd

# ***Loading the data set of IMDB***

In [ ]:
movies = pd.read_csv("/content/drive/MyDrive/Salaries/IMDB-Movie-Data.csv")

movies.head(10)

   Rank                    Title  ... Revenue (Millions) Metascore
0     1  Guardians of the Galaxy  ...             333.13      76.0
1     2               Prometheus  ...             126.46      65.0
2     3                    Split  ...             138.12      62.0
3     4                     Sing  ...             270.32      59.0
4     5            Suicide Squad  ...             325.02      40.0
5     6           The Great Wall  ...              45.13      42.0
6     7               La La Land  ...             151.06      93.0
7     8                 Mindhorn  ...                NaN      71.0
8     9       The Lost City of Z  ...               8.01      78.0
9    10               Passengers  ...             100.01      41.0

[10 rows x 12 columns]

# ***Understand the basic information about the dataset and inspect the dataframe's columns, shapes, variable types etc.***

In [ ]:
## Viewing the columns

movies.columns

Index(['Rank', 'Title', 'Genre', 'Description', 'Director', 'Actors', 'Year',
       'Runtime (Minutes)', 'Rating', 'Votes', 'Revenue (Millions)',
       'Metascore'],
      dtype='object')

In [ ]:
## Inspecting shapes
movies.shape

(1000, 12)

In [ ]:
## Inspecting Data Types

print(movies.dtypes)

Rank                    int64
Title                  object
Genre                  object
Description            object
Director               object
Actors                 object
Year                    int64
Runtime (Minutes)       int64
Rating                float64
Votes                   int64
Revenue (Millions)    float64
Metascore             float64
dtype: object

In [ ]:
## Inspecting Dimensions
print(movies.ndim)

2

In [ ]:
## Inspecting Size
movies.size

12000

# ***Basic Statistics about this Dataset***

In [ ]:
movies.describe()

              Rank         Year  ...  Revenue (Millions)   Metascore
count  1000.000000  1000.000000  ...          872.000000  936.000000
mean    500.500000  2012.783000  ...           82.956376   58.985043
std     288.819436     3.205962  ...          103.253540   17.194757
min       1.000000  2006.000000  ...            0.000000   11.000000
25%     250.750000  2010.000000  ...           13.270000   47.000000
50%     500.500000  2014.000000  ...           47.985000   59.500000
75%     750.250000  2016.000000  ...          113.715000   72.000000
max    1000.000000  2016.000000  ...          936.630000  100.000000

[8 rows x 7 columns]

In [ ]:
movies.head(30).mean()

Rank                      15.500000
Year                    2015.766667
Runtime (Minutes)        116.500000
Rating                     7.020000
Votes                 154962.633333
Revenue (Millions)       145.189259
Metascore                 63.851852
dtype: float64

# ***Data Selection -- Indexing and Slicing the data***

In [ ]:
## Selecting movies rating only ;;

movie_rating = movies[['Rating']]
movie_rating

     Rating
0       8.1
1       7.0
2       7.3
3       7.2
4       6.2
..      ...
995     6.2
996     5.5
997     6.2
998     5.6
999     5.3

[1000 rows x 1 columns]

In [ ]:
## Selecting only movies Titles

movie_title = movies[['Title']]
movie_title

                       Title
0    Guardians of the Galaxy
1                 Prometheus
2                      Split
3                       Sing
4              Suicide Squad
..                       ...
995     Secret in Their Eyes
996          Hostel: Part II
997   Step Up 2: The Streets
998             Search Party
999               Nine Lives

[1000 rows x 1 columns]

# ***Data Selection Based on Conditions***

In [ ]:
## Selection of movies less earned revenue

less_earned = movies[movies['Revenue (Millions)'] == movies['Revenue (Millions)'].min()]
print(less_earned)

     Rank             Title  ... Revenue (Millions) Metascore
231   232  A Kind of Murder  ...                0.0      50.0

[1 rows x 12 columns]

In [ ]:
## Selection of Movies title having most rating on IMBD

top_rated = movies[["Title","Director","Rating"]][movies["Rating"] == movies["Rating"].max()]
print(top_rated)

              Title           Director  Rating
54  The Dark Knight  Christopher Nolan     9.0

# ***Groupby Operations***

In [ ]:
'genres = movies.groupby('Genre')['Revenue (Millions)'].mean().reset_index()
print(genres)

                          Genre  Revenue (Millions)
0                        Action          131.560000
1              Action,Adventure          223.740000
2    Action,Adventure,Biography           16.500000
3       Action,Adventure,Comedy           95.733571
4        Action,Adventure,Crime           90.620000
..                          ...                 ...
202     Romance,Sci-Fi,Thriller           62.450000
203                      Sci-Fi           20.760000
204             Sci-Fi,Thriller           64.510000
205                    Thriller            0.320000
206                Thriller,War                 NaN

[207 rows x 2 columns]

# ***Sorting Operations***

In [ ]:
top_rated = movies.sort_values(["Title","Genre","Revenue (Millions)"], ascending=False)[["Title","Director","Revenue (Millions)"]]
top_rated.head(10)

                             Title            Director  Revenue (Millions)
74                        Zootopia        Byron Howard              341.26
431                    Zoolander 2         Ben Stiller               28.84
363                     Zombieland     Ruben Fleischer               75.59
277                         Zodiac       David Fincher               33.05
544                         Zipper       Mora Stephens                 NaN
406               Zero Dark Thirty     Kathryn Bigelow               95.72
792     Zack and Miri Make a Porno         Kevin Smith               31.45
503                          Youth    Paolo Sorrentino                2.70
985                  Your Highness  David Gordon Green               21.56
837  You Don't Mess with the Zohan        Dennis Dugan              100.02

# ***Dealing with missing values***

In [ ]:
movies.isna().any()

Rank                  False
Title                 False
Genre                 False
Description           False
Director              False
Actors                False
Year                  False
Runtime (Minutes)     False
Rating                False
Votes                 False
Revenue (Millions)     True
Metascore              True
dtype: bool

In [ ]:
print(movies.isna().sum())

Rank                    0
Title                   0
Genre                   0
Description             0
Director                0
Actors                  0
Year                    0
Runtime (Minutes)       0
Rating                  0
Votes                   0
Revenue (Millions)    128
Metascore              64
dtype: int64

# ***Dropping Columns and Null values***

In [ ]:
imdb_clean_data = movies.dropna()
imdb_clean_data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 838 entries, 0 to 999
Data columns (total 12 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Rank                838 non-null    int64
 1   Title               838 non-null    object
 2   Genre               838 non-null    object
 3   Description         838 non-null    object
 4   Director            838 non-null    object
 5   Actors              838 non-null    object
 6   Year                838 non-null    int64
 7   Runtime (Minutes)   838 non-null    int64
 8   Rating              838 non-null    float64
 9   Votes               838 non-null    int64
 10  Revenue (Millions)  838 non-null    float64
 11  Metascore           838 non-null    float64
dtypes: float64(3), int64(4), object(5)
memory usage: 85.1+ KB

# ***Apply() Function***

In [ ]:
top_rated_revenue = imdb_clean_data.sort_values(["Rating","Metascore"], ascending=False)[["Title", "Director", "Rating","Metascore", "Revenue (Millions)"]]
top_rated_revenue.index = range(1,839)
top_rated_revenue.head(n=15)

                    Title  ... Revenue (Millions)
1         The Dark Knight  ...             533.32
2               Inception  ...             292.57
3           Kimi no na wa  ...               4.68
4            Interstellar  ...             187.99
5        The Intouchables  ...              13.18
6     The Lives of Others  ...              11.28
7                Whiplash  ...              13.09
8            The Departed  ...             132.37
9   The Dark Knight Rises  ...             448.13
10           The Prestige  ...              53.08
11       Taare Zameen Par  ...               1.20
12       Django Unchained  ...             162.80
13               3 Idiots  ...               6.52
14             La La Land  ...             151.06
15            Toy Story 3  ...             414.98

[15 rows x 5 columns]